Revit 2024 API
LightDimmingColor Enumeration
 Tags for specific light dimming colors
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum LightDimmingColor
Visual Basic
Public Enumeration LightDimmingColor
Visual C++
public enum class LightDimmingColor
Members
Member name | Description
None |  No dimming color.
Incandescent |  Incandescent lamp curve dimming color.
See Also
Autodesk.Revit.DB.Lighting Namespace